newwms_gift/src/Documents/итWMSРазмещение/итWMSРазмещение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>итWMSРазмещение</name>
  <basedOn>Document.итWMSПриемка</basedOn>
  <registerRecords>AccumulationRegister.итТоварыВЯчейках</registerRecords>
  <attributes>
    <name>итОснование</name>
    <type>
      <types>DocumentRef.итWMSПриемка</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусДокумента</name>
    <type>
      <types>EnumRef.итWMSСтатусыСкладскихДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СнимокТабличнойЧастиДоРаспределения</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗавершенияДокумента</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>НеРаспределятьНаТСД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СтратегияРазмещения</name>
    <type>
      <types>CatalogRef.итWMSСтратегии</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерВходящегоДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВходящегоДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СкладскоеПомещениеРазмещения</name>
    <type>
      <types>CatalogRef.итСкладскиеПомещения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрыСтратегии</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресХраненияПараметров</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторУпаковки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>172</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СерияНоменклатуры</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Качество</name>
      <type>
        <types>CatalogRef.Качество</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРозлива</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЯчейкаОтправитель</name>
      <type>
        <types>CatalogRef.итСкладскиеЯчейки</types>
      </type>
    </attributes>
    <attributes>
      <name>ЯчейкаПолучатель</name>
      <type>
        <types>CatalogRef.итСкладскиеЯчейки</types>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеЗадачи</name>
      <type>
        <types>EnumRef.итWMSСостоянияЗадачТСД</types>
      </type>
    </attributes>
    <attributes>
      <name>КарантинПаллеты</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

newwms_gift/src/InformationRegisters/итWMSЗадачиТСД/итWMSЗадачиТСД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>итWMSЗадачиТСД</name>
  <resources>
    <name>ИдентификаторУпаковки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>172</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЯчейкаОтправитель</name>
    <type>
      <types>CatalogRef.итСкладскиеЯчейки</types>
    </type>
  </resources>
  <resources>
    <name>ЯчейкаПолучатель</name>
    <type>
      <types>CatalogRef.итСкладскиеЯчейки</types>
    </type>
  </resources>
  <resources>
    <name>ДополнительныеДанные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.итWMSСостоянияЗадачТСД</types>
    </type>
  </attributes>
  <attributes>
    <name>ФиксацияЗадачи</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеДокументаТСД</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <dimensions>
    <name>ТСД</name>
    <type>
      <types>CatalogRef.итWMSСправочникТСД</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.итWMSКонтрольнаяОперацияАгрегации</types>
      <types>DocumentRef.итWMSРазмещение</types>
      <types>DocumentRef.итWMSЗадачиИнвентаризации</types>
      <types>DocumentRef.итWMSПроверка</types>
      <types>DocumentRef.итWMSНаборка</types>
      <types>DocumentRef.итWMSПеремещение</types>
      <types>DocumentRef.итWMSОтгрузка</types>
      <types>DocumentRef.итWMSПриемка</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипЗадачи</name>
    <type>
      <types>EnumRef.итWMSТипыЗадачТСД</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдЗадачи</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдЗадачиРодителя</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

newwms_gift/src/InformationRegisters/итWMSСтрокиЗадачТСД/итWMSСтрокиЗадачТСД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>итWMSСтрокиЗадачТСД</name>
  <resources>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </resources>
  <resources>
    <name>ДатаРозлива</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>СерияНоменклатуры</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДополнительныеДанные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <attributes>
    <name>ДанныеДокументаТСД</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <dimensions>
    <name>ИдЗадачи</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>идСтроки</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

newwms_gift/src/Enums/итWMSСтатусыСкладскихДокументов/итWMSСтатусыСкладскихДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>итWMSСтатусыСкладскихДокументов</name>
  <enumValues>
    <name>Создан</name>
  </enumValues>
  <enumValues>
    <name>Зарезервирован</name>
  </enumValues>
  <enumValues>
    <name>Распределяется</name>
  </enumValues>
  <enumValues>
    <name>Распределен</name>
  </enumValues>
  <enumValues>
    <name>Выполнен</name>
  </enumValues>
  <enumValues>
    <name>ВыполненСОшибкой</name>
  </enumValues>
  <enumValues>
    <name>Завершен</name>
  </enumValues>
</mdclass:Enum>

newwms_gift/src/Enums/итWMSСостоянияЗадачТСД/итWMSСостоянияЗадачТСД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>итWMSСостоянияЗадачТСД</name>
  <enumValues>
    <name>КВыполнению</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетРазрешения</name>
  </enumValues>
  <enumValues>
    <name>Отменена</name>
  </enumValues>
  <enumValues>
    <name>Выполнена</name>
  </enumValues>
  <enumValues>
    <name>Выполняется</name>
  </enumValues>
</mdclass:Enum>

newwms_gift/src/Documents/ПоступлениеТоваровУслуг/ПоступлениеТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеТоваровУслуг</name>
  <basedOn>Document.итWMSПриемка</basedOn>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>итОснование</name>
    <type>
      <types>DocumentRef.итWMSПриемка</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерВходящегоДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВходящегоДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СерияНоменклатуры</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатуры</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Качество</name>
      <type>
        <types>CatalogRef.Качество</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

newwms_gift/src/Documents/итWMSРазмещение/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытий
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.СтатусДокумента=Перечисления.итWMSСтатусыСкладскихДокументов.Распределен Тогда
		ОбновитьДанныеСТСД();
	КонецЕсли;
	Если Параметры.Ключ.Пустая() тогда
		Объект.итОснование=Неопределено;
		Если Объект.Товары.Количество()>0 тогда
			для Каждого стр из Объект.Товары цикл
				стр.ИдентификаторСтроки=новый УникальныйИдентификатор;
			КонецЦикла;
		КонецЕсли;	
		Если Параметры.Свойство("ПараметрыЗаполненияДанных") тогда
			Если ПроверкаНаИмещийсяДокументРазмещенияПоОснованию(Параметры.ПараметрыЗаполненияДанных) тогда
				Сообщить("У документа уже имеется проведенный документ размещения");
				Отказ=Истина;
				Возврат
			КонецЕсли;
			Данные=РеквизитФормыВЗначение("Объект");
			Данные.ОбработкаЗаполнения(Параметры.ПараметрыЗаполненияДанных,Ложь);
			ЗначениеВРеквизитФормы(Данные,"Объект");
		КонецЕсли;	
		Объект.Дата=ТекущаяДата();
		Объект.СтатусДокумента=Перечисления.итWMSСтатусыСкладскихДокументов.Создан;
		Объект.Ответственный=ПараметрыСеанса.ТекущийПользователь;
		
	КонецЕсли;
	ВосстановитьДанныеПараметровСтратегииСервер();
	ПроставитьПредставлениеИдентификатора();	  
КонецПроцедуры
&НаКлиенте
Процедура ТоварыСостояниеЗадачиПриИзменении(Элемент)
	ГрупповоеИзменениеСпискаПоИдУпаковки("СостояниеЗадачи",Элемент.Родитель.ТекущиеДанные.СостояниеЗадачи,Элемент.Родитель.ТекущиеДанные.ИдентификаторУпаковки);
КонецПроцедуры
&НаКлиенте
Процедура ТоварыЯчейкаПолучательПриИзменении(Элемент)
	ГрупповоеИзменениеСпискаПоИдУпаковки("ЯчейкаПолучатель",Элемент.Родитель.ТекущиеДанные.ЯчейкаПолучатель,Элемент.Родитель.ТекущиеДанные.ИдентификаторУпаковки);
КонецПроцедуры
&НаКлиенте
Процедура ТоварыКомментарийПриИзменении(Элемент)
	ГрупповоеИзменениеСпискаПоИдУпаковки("Комментарий",Элемент.Родитель.ТекущиеДанные.Комментарий,Элемент.Родитель.ТекущиеДанные.ИдентификаторУпаковки);
КонецПроцедуры
&НаСервереБезКонтекста
Процедура ТоварыИдентификаторУпаковкиНачалоВыбораНаСервере(Основание,СтруктураДанных,Отказ)
	Если ТипЗнч(Основание)<>Тип("ДокументСсылка.итWMSПриемка") тогда
		Сообщить("не верный формат основания");
		Отказ=Истина;
		Возврат
	КонецЕсли;	
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	итWMSПриемкаТовары.ИдентификаторУпаковки
	|ИЗ
	|	Документ.итWMSПриемка.Товары КАК итWMSПриемкаТовары
	|ГДЕ
	|	итWMSПриемкаТовары.Ссылка = &Основание
	|
	|СГРУППИРОВАТЬ ПО
	|	итWMSПриемкаТовары.ИдентификаторУпаковки";
	
	Запрос.УстановитьПараметр("Основание", Основание);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	СтруктураДанных.Вставить("СписокИдентификаторУпаковки",РезультатЗапроса.ВыгрузитьКолонку("ИдентификаторУпаковки"));
КонецПроцедуры

&НаКлиенте
Процедура ТоварыИдентификаторУпаковкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	Отказ=ложь;
	СтруктураДанных=новый Структура("СписокИдентификаторУпаковки,Организация,Ответственный",Неопределено,Объект.Организация,ПолучитьТекущегоПользователя());
	ТоварыИдентификаторУпаковкиНачалоВыбораНаСервере(Объект.итОснование,СтруктураДанных,Отказ);
	Если Отказ Тогда 
		Возврат
	КонецЕсли;
	ОткрытьФорму("Документ.итWMSРазмещение.Форма.ФормаЗапросаИдентификатораУпаковки",СтруктураДанных,Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыИдентификаторУпаковкиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	Элемент.Родитель.ТекущиеДанные.ИдентификаторУпаковки= ВыбранноеЗначение;
	
КонецПроцедуры




&НаКлиенте
Процедура ТоварыСкладПриИзменении(Элемент)
	ГрупповоеИзменениеСпискаПоИдУпаковки("Склад",Элемент.Родитель.ТекущиеДанные.Склад,Элемент.Родитель.ТекущиеДанные.ИдентификаторУпаковки);
КонецПроцедуры



&НаКлиенте
Процедура ТоварыЯчейкаОтправительПриИзменении(Элемент)
	ГрупповоеИзменениеСпискаПоИдУпаковки("ЯчейкаОтправитель",Элемент.Родитель.ТекущиеДанные.ЯчейкаОтправитель,Элемент.Родитель.ТекущиеДанные.ИдентификаторУпаковки)
КонецПроцедуры
&НаКлиенте
Процедура ТоварыКарантинПаллетыПриИзменении(Элемент)
	ГрупповоеИзменениеСпискаПоИдУпаковки("КарантинПаллеты",Элемент.Родитель.ТекущиеДанные.КарантинПаллеты,Элемент.Родитель.ТекущиеДанные.ИдентификаторУпаковки);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Картинка = новый Картинка(ПолучитьКартинкуИзБиблиотеки());
	АдресКартинкиКуба=ПоместитьВоВременноеХранилище(Картинка,ЭтаФорма.УникальныйИдентификатор);
	ВидимостьДоступностьЭлементов();
	ВариантОтображенияПользователя();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыДеревоНоменклатураПриИзменении(Элемент)
	ОбработчикТрансляцииПриИзменении(Элемент);	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыДеревоХарактеристикаПриИзменении(Элемент)
	ОбработчикТрансляцииПриИзменении(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыДеревоКачествоПриИзменении(Элемент)
	ОбработчикТрансляцииПриИзменении(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыДеревоДатаРозливаПриИзменении(Элемент)
	ОбработчикТрансляцииПриИзменении(Элемент);
КонецПроцедуры


&НаКлиенте
Процедура ТоварыДеревоКоличествоПриИзменении(Элемент)
	ОбработчикТрансляцииПриИзменении(Элемент);
	РассчетКоличестваВУпаковкеПриИзменении(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыДеревоСостояниеЗадачиПриИзменении(Элемент)
	СписокЭлементовДерева=Элемент.Родитель.ТекущиеДанные.ПолучитьЭлементы();
	для Каждого  стр из СписокЭлементовДерева цикл
		Строка=Объект.Товары.НайтиСтроки(новый Структура("ИдентификаторСтрокиПредставление",стр.ИдентификаторСтрокиПредставление));
		Строка[0].СостояниеЗадачи=Элемент.Родитель.ТекущиеДанные.СостояниеЗадачи;
	КонецЦикла;
	ЭтаФорма.Модифицированность=Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыДеревоЯчейкаПолучательПриИзменении(Элемент)
	СписокЭлементовДерева=Элемент.Родитель.ТекущиеДанные.ПолучитьЭлементы();
	для Каждого  стр из СписокЭлементовДерева цикл
		Строка=Объект.Товары.НайтиСтроки(новый Структура("ИдентификаторСтрокиПредставление",стр.ИдентификаторСтрокиПредставление));
		Строка[0].ЯчейкаПолучатель=Элемент.Родитель.ТекущиеДанные.ЯчейкаПолучатель;
	КонецЦикла;
	ЭтаФорма.Модифицированность=Истина;
КонецПроцедуры
&НаКлиенте
Процедура ТоварыДеревоСкладПриИзменении(Элемент)
	СписокЭлементовДерева=Элемент.Родитель.ТекущиеДанные.ПолучитьЭлементы();
	для Каждого  стр из СписокЭлементовДерева цикл
		Строка=Объект.Товары.НайтиСтроки(новый Структура("ИдентификаторСтрокиПредставление",стр.ИдентификаторСтрокиПредставление));
		Строка[0].Склад=Элемент.Родитель.ТекущиеДанные.Склад;
	КонецЦикла;
	ЭтаФорма.Модифицированность=Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыДеревоЯчейкаОтправительПриИзменении(Элемент)
	СписокЭлементовДерева=Элемент.Родитель.ТекущиеДанные.ПолучитьЭлементы();
	для Каждого  стр из СписокЭлементовДерева цикл
		Строка=Объект.Товары.НайтиСтроки(новый Структура("ИдентификаторСтрокиПредставление",стр.ИдентификаторСтрокиПредставление));
		Строка[0].ЯчейкаОтправитель=Элемент.Родитель.ТекущиеДанные.ЯчейкаОтправитель;
	КонецЦикла;
	ЭтаФорма.Модифицированность=Истина;
	
КонецПроцедуры
&НаКлиенте
Процедура ТоварыДеревоКарантинПаллетыПриИзменении(Элемент)
	СписокЭлементовДерева=Элемент.Родитель.ТекущиеДанные.ПолучитьЭлементы();
	для Каждого  стр из СписокЭлементовДерева цикл
		Строка=Объект.Товары.НайтиСтроки(новый Структура("ИдентификаторСтрокиПредставление",стр.ИдентификаторСтрокиПредставление));
		Строка[0].КарантинПаллеты=Элемент.Родитель.ТекущиеДанные.КарантинПаллеты;
	КонецЦикла;
	ЭтаФорма.Модифицированность=Истина;
	
КонецПроцедуры
&НаКлиенте
Процедура ТоварыДеревоКомментарийПриИзменении(Элемент)
	СписокЭлементовДерева=Элемент.Родитель.ТекущиеДанные.ПолучитьЭлементы();
	для Каждого  стр из СписокЭлементовДерева цикл
		Строка=Объект.Товары.НайтиСтроки(новый Структура("ИдентификаторСтрокиПредставление",стр.ИдентификаторСтрокиПредставление));
		Строка[0].Комментарий=Элемент.Родитель.ТекущиеДанные.Комментарий;
	КонецЦикла;
	ЭтаФорма.Модифицированность=Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыДеревоСерияНоменклатурыПриИзменении(Элемент)
	ОбработчикТрансляцииПриИзменении(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыДеревоПередУдалением(Элемент, Отказ)
	Если Элемент.ВыделенныеСтроки.Количество()>1 тогда
		Сообщить("В режиме дерева можно удалять 1 любую строку за раз");
		Отказ=Истина;
		Возврат
	КонецЕсли;	
	Если Элемент.ТекущиеДанные.СтрокаУпаковки тогда
		Оповещение = новый ОписаниеОповещения("ОбработчикДиалогов",ЭтаФорма," ОбработчикУдалениеУпаковки();");
		ПоказатьВопрос(Оповещение,"Если удалить паллету, то все строки в ней так же будут удалены",РежимДиалогаВопрос.ДаНет);
		Отказ=Истина;
		Возврат
	иначе
		МассивСтроки=Объект.Товары.НайтиСтроки(новый Структура("ИдентификаторСтрокиПредставление",Элемент.ТекущиеДанные.ИдентификаторСтрокиПредставление));
		Строка=МассивСтроки[0];
		Объект.Товары.Удалить(Строка);
	КонецЕсли;
	ЭтаФорма.Модифицированность=Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыДеревоПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	СтрокаПеретаскиванияКуда=Элементы.ТоварыДерево.ДанныеСтроки(Строка);
	Если не СтрокаПеретаскиванияКуда.СтрокаУпаковки тогда
		пока не СтрокаПеретаскиванияКуда.СтрокаУпаковки цикл
			СтрокаПеретаскиванияКуда=СтрокаПеретаскиванияКуда.ПолучитьРодителя();
		КонецЦикла;
	КонецЕсли;
	СтандартнаяОбработка=Ложь;
	для Каждого стр из ПараметрыПеретаскивания.Значение цикл
		ТекущаяСтрокаОбработки=Элементы.ТоварыДерево.ДанныеСтроки(стр);
		Если ТекущаяСтрокаОбработки.СтрокаУпаковки тогда
			Продолжить;
		КонецЕсли;	
		ТекущаяСтрокаОбработки.ИдентификаторУпаковки=СтрокаПеретаскиванияКуда.ИдентификаторУпаковки;
		НоваяСтрока=СтрокаПеретаскиванияКуда.ПолучитьЭлементы().Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,ТекущаяСтрокаОбработки);
		НоваяСтрока.ЯчейкаПолучатель=СтрокаПеретаскиванияКуда.ЯчейкаПолучатель;
		НоваяСтрока.ЯчейкаОтправитель=СтрокаПеретаскиванияКуда.ЯчейкаОтправитель;
		СтарыйРодитель=ТекущаяСтрокаОбработки.ПолучитьРодителя();
		СтарыйРодитель.ПолучитьЭлементы().Удалить(ТекущаяСтрокаОбработки);
		
		/////Обработчики Изменения
		СтрукрутраДляИзменения=новый Структура;
		СтрукрутраДляИзменения.Вставить("Имя","ИдентификаторУпаковки");
		СтрукрутраДляИзменения.Вставить("Родитель",новый Структура("ТекущиеДанные",НоваяСтрока));
		ОбработчикТрансляцииПриИзменении(СтрукрутраДляИзменения);
		СтрукрутраДляИзменения.Вставить("Имя","ЯчейкаПолучатель");
		СтрукрутраДляИзменения.Вставить("Родитель",новый Структура("ТекущиеДанные",НоваяСтрока));
		ОбработчикТрансляцииПриИзменении(СтрукрутраДляИзменения);
		
		СтрукрутраДляИзменения.Вставить("Имя","ЯчейкаОтправитель");
		СтрукрутраДляИзменения.Вставить("Родитель",новый Структура("ТекущиеДанные",НоваяСтрока));
		ОбработчикТрансляцииПриИзменении(СтрукрутраДляИзменения);
		
		
		СтрукрутраДляИзменения.Имя="Количество";
		СтрукрутраДляИзменения.Вставить("Родитель",новый Структура("ТекущиеДанные",НоваяСтрока));
		РассчетКоличестваВУпаковкеПриИзменении(СтрукрутраДляИзменения) ;
		
		СтрукрутраДляИзменения.Имя="Количество";
		СтрукрутраДляИзменения.Вставить("Родитель",новый Структура("ТекущиеДанные",СтарыйРодитель));
		РассчетКоличестваВУпаковкеПриИзменении(СтрукрутраДляИзменения) ;
		
	КонецЦикла;
КонецПроцедуры
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ВидимостьДоступностьЭлементов();
	ПроставитьПредставлениеИдентификатора();
	Если Объект.Проведен тогда
		Если Объект.итОснование.Пустая() тогда
			Возврат
		КонецЕсли;	
		Если не ПроверкаНаЗавершенностьПриемкиОснования(Объект.итОснование) тогда
			ЗавершитьПримкуНаСервере(Объект.итОснование);
			Оповестить("WMSЗавршениеПриемки",Объект.итОснование,Объект.Ссылка);	
		КонецЕсли;
	КонецЕсли;
	ПодключитьОбработчикОжидания("ВосстановитьДанныеПараметровСтратегии",0.1,Истина);	
КонецПроцедуры
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	ПроверкаНаЗаполненностьЯчейкиПолучателя(Отказ, ПараметрыЗаписи);	
КонецПроцедуры

&НаКлиенте
Процедура СтратегияРазмещенияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	ОткрытьФорму("Справочник.итWMSСтратегии.ФормаВыбора",новый Структура("ОтборИерархии",ПолучитьИерархиюСтратегииРазмещения()),Элемент);
КонецПроцедуры
&НаКлиенте
Процедура СкладПриИзменении(Элемент)
	для Каждого  стр из Объект.Товары цикл
		стр.Склад=Объект.Склад;
	КонецЦикла;
	ВариантОтображенияПользователя();	
КонецПроцедуры
&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
		Если ИсточникВыбора.ИмяФормы="Документ.итWMSРазмещение.Форма.ФормаИзмененияДанныхСтроки" тогда
			ОбработкаИзмененияРаспределенныхДанных(ВыбранноеЗначение);
			ВариантОтображенияПользователя();
		КонецЕсли;
		Если ИсточникВыбора.ИмяФормы="ОбщаяФорма.итWMSФормаПараметровСтратегии" тогда
			ПоместитьВоВременноеХранилище(ВыбранноеЗначение,Объект.АдресХраненияПараметров);
		КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКоманд
&НаКлиенте
Процедура ВВидеДерева(Команда)
	ВВидеДереваНаСервере();
	Элементы.ТоварыДерево.Видимость=Истина;
	Элементы.Товары.Видимость=Ложь;
	ТригерОтображения=Истина;
КонецПроцедуры
&НаСервере
Процедура ВВидеДереваНаСервере()
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	ТоварыДерево.ПолучитьЭлементы().Очистить();
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Товары.ИдентификаторСтрокиПредставление,
	|	Товары.ИдентификаторУпаковки,
	|	Товары.Номенклатура,
	|	Товары.Характеристика,
	|	Товары.Качество,
	|	Товары.ДатаРозлива,
	|	Товары.ЯчейкаПолучатель,
	|	Товары.СостояниеЗадачи,
	|	Товары.ЯчейкаОтправитель,
	|	Товары.Количество,
	|	Товары.СерияНоменклатуры,
	|	Товары.КарантинПаллеты,
	|	Товары.Склад,
	|	Товары.Комментарий
	|ПОМЕСТИТЬ ТчТовары
	|ИЗ
	|	&Товары КАК Товары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТчТовары.ИдентификаторСтрокиПредставление,
	|	ТчТовары.ИдентификаторУпаковки КАК ИдентификаторУпаковки,
	|	ТчТовары.Номенклатура,
	|	ТчТовары.Характеристика,
	|	ТчТовары.Качество,
	|	ТчТовары.ДатаРозлива,
	|	ТчТовары.ЯчейкаПолучатель КАК ЯчейкаПолучатель,
	|	ТчТовары.СостояниеЗадачи КАК СостояниеЗадачи,
	|	ТчТовары.ЯчейкаОтправитель КАК ЯчейкаОтправитель,
	|	ТчТовары.Количество КАК Количество,
	|	ТчТовары.СерияНоменклатуры,
	|	ВЫБОР
	|		КОГДА ТчТовары.КарантинПаллеты
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КарантинПаллеты,
	|	ТчТовары.Склад КАК Склад,
	|	ТчТовары.Комментарий КАК Комментарий
	|ИЗ
	|	ТчТовары КАК ТчТовары
	|ИТОГИ
	|	МАКСИМУМ(ЯчейкаПолучатель),
	|	МАКСИМУМ(СостояниеЗадачи),
	|	МАКСИМУМ(ЯчейкаОтправитель),
	|	СУММА(Количество),
	|	МАКСИМУМ(КарантинПаллеты),
	|	МАКСИМУМ(Склад),
	|	МАКСИМУМ(Комментарий)
	|ПО
	|	ИдентификаторУпаковки";
	
	Запрос.УстановитьПараметр("Товары",Объект.Товары.Выгрузить());	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаУпаковка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	пока ВыборкаУпаковка.Следующий() цикл
		НоваяСтрокаУпаковкаДерево = ТоварыДерево.ПолучитьЭлементы().Добавить();
		НоваяСтрокаУпаковкаДерево.ИдентификаторУпаковки= ВыборкаУпаковка.ИдентификаторУпаковки;
		НоваяСтрокаУпаковкаДерево.ЯчейкаПолучатель = ВыборкаУпаковка.ЯчейкаПолучатель;
		НоваяСтрокаУпаковкаДерево.ЯчейкаОтправитель = ВыборкаУпаковка.ЯчейкаОтправитель;
		НоваяСтрокаУпаковкаДерево.Количество=ВыборкаУпаковка.Количество;
		НоваяСтрокаУпаковкаДерево.СостояниеЗадачи=ВыборкаУпаковка.СостояниеЗадачи;
		НоваяСтрокаУпаковкаДерево.Картинка=АдресКартинкиКуба;
		НоваяСтрокаУпаковкаДерево.СтрокаУпаковки=Истина;
		НоваяСтрокаУпаковкаДерево.Склад=ВыборкаУпаковка.Склад;
		НоваяСтрокаУпаковкаДерево.Комментарий=ВыборкаУпаковка.Комментарий;
		Если ВыборкаУпаковка.КарантинПаллеты>0 тогда
			НоваяСтрокаУпаковкаДерево.КарантинПаллеты=Истина;
		КонецЕсли;	 
		
		ВыборкаДетальныеЗаписи=ВыборкаУпаковка.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			НоваяСтрокаНоменклатуры = НоваяСтрокаУпаковкаДерево.ПолучитьЭлементы().Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаНоменклатуры,ВыборкаДетальныеЗаписи);
			НоваяСтрокаНоменклатуры.ЯчейкаПолучатель=Справочники.итСкладскиеЯчейки.ПустаяСсылка();
			НоваяСтрокаНоменклатуры.ЯчейкаОтправитель=Справочники.итСкладскиеЯчейки.ПустаяСсылка();
			НоваяСтрокаНоменклатуры.Склад=Справочники.Склады.ПустаяСсылка();
			НоваяСтрокаНоменклатуры.Комментарий="";
		КонецЦикла;
	КонецЦикла;
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	
КонецПроцедуры
&НаКлиенте
Процедура ВВидеСписка(Команда)
	Элементы.ТоварыДерево.Видимость=Ложь;
	Элементы.Товары.Видимость=Истина;
	ТригерОтображения=Ложь;
КонецПроцедуры
&НаКлиенте
Процедура СкопироватьТовары(Команда)
	Если  Элементы.ГруппаТовары.ТолькоПросмотр тогда
		Возврат
	КонецЕсли;	
	Если ТекущийЭлемент.Имя="Товары" тогда
		НоваяСтрока=Объект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,ТекущийЭлемент.ТекущиеДанные);
		НоваяСтрока.ИдентификаторСтроки=новый УникальныйИдентификатор;
		НоваяСтрока.ИдентификаторСтрокиПредставление=Строка(НоваяСтрока.ИдентификаторСтроки);
	КонецЕсли;
КонецПроцедуры
&НаКлиенте
Процедура ДобавитьТовары(Команда)
	Если  Элементы.ГруппаТовары.ТолькоПросмотр тогда
		Возврат
	КонецЕсли;	
	НоваяСтрока=Объект.Товары.Добавить();
	НоваяСтрока.ИдентификаторСтроки=новый УникальныйИдентификатор;
	НоваяСтрока.ИдентификаторСтрокиПредставление= Строка(НоваяСтрока.ИдентификаторСтроки);
КонецПроцедуры
&НаКлиенте
Процедура Развернуть(Команда)
	//СтрокиПаллет=ПаллетМеста.ПолучитьЭлементы();
	//для Каждого Паллета из СтрокиПаллет цикл
	//	Элементы.ПаллетМеста.Развернуть(Паллета.ПолучитьИдентификатор());
	//КонецЦикла;
	Строки=ТоварыДерево.ПолучитьЭлементы();
	Если Строки.Количество()>0 тогда
		РазвернутьДанные(Строки);
	КонецЕсли;	
КонецПроцедуры
&НаКлиенте
Процедура РазвернутьДанные(Строки)
	для Каждого Строка из Строки цикл
		Элементы.ТоварыДерево.Развернуть(Строка.ПолучитьИдентификатор());
		ПодчиненныеСтроки= Строка.ПолучитьЭлементы();
		Если ПодчиненныеСтроки.Количество()>0 тогда
			РазвернутьДанные(ПодчиненныеСтроки);
		КонецЕсли;	
	КонецЦикла;
КонецПроцедуры
&НаКлиенте
Процедура Свернуть(Команда)
	Строки=ТоварыДерево.ПолучитьЭлементы();
	Если Строки.Количество()>0 тогда
		СвернутьДанные(Строки);
	КонецЕсли;	
КонецПроцедуры
&НаКлиенте	
Процедура СвернутьДанные(Строки)
	для Каждого Строка из Строки цикл
		ПодчиненныеСтроки= Строка.ПолучитьЭлементы();
		Если ПодчиненныеСтроки.Количество()>0 тогда
			СвернутьДанные(ПодчиненныеСтроки);
		КонецЕсли;	
		Элементы.ТоварыДерево.Свернуть(Строка.ПолучитьИдентификатор());
	КонецЦикла;	
КонецПроцедуры
&НаСервере
Процедура РазместитьПаллетыНаСервере()
	для Каждого стр из Объект.Товары цикл
		стр.ЯчейкаПолучатель=Справочники.итСкладскиеЯчейки.ПустаяСсылка();
	КонецЦикла;	
	Данные=РеквизитФормыВЗначение("Объект");
	Данные.ВыборСтратегииРазмещения();
	ЗначениеВРеквизитФормы(Данные,"Объект");
КонецПроцедуры

&НаКлиенте
Процедура РазместитьПаллеты(Команда)	
	РазместитьПаллетыНаСервере();
	ПроставитьПредставлениеИдентификатора();
	ВариантОтображенияПользователя();	
КонецПроцедуры

&НаСервере
Процедура ПечатьЯчеекНаСервере(ТабличныйДокумент)
	Данные = РеквизитФормыВЗначение("Объект");
	Данные.ПечатьЭтикетокЯчеекНаПаллеты(ТабличныйДокумент,Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ПечатьЯчеек(Команда)
	Если Объект.Ссылка.Пустая() тогда
		Сообщить("Запишите документ");
		Возврат
	КонецЕсли;	
	ТабличныйДокумент= новый ТабличныйДокумент;
	ПечатьЯчеекНаСервере(ТабличныйДокумент);
	ТабличныйДокумент.Показать();
КонецПроцедуры
&НаСервере
Процедура ПечатьРеестрРазмещенияНаСервере(ТабличныйДокумент)
	Данные = РеквизитФормыВЗначение("Объект");
	Данные.ПечатьМакетВсеНаОдномЛисте(ТабличныйДокумент,Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ПечатьРеестрРазмещения(Команда)
	Если Объект.Ссылка.Пустая() тогда
		Сообщить("Запишите документ");
		Возврат
	КонецЕсли;	
	ТабличныйДокумент= новый ТабличныйДокумент;
	ПечатьРеестрРазмещенияНаСервере(ТабличныйДокумент);
	ТабличныйДокумент.Показать();
	
КонецПроцедуры
&НаСервере
Процедура ИзменитьЯчейкуИлиСкладНаСервере(СтруктураДанныхКИзменению,Отказ,ИндификаторСтрокиКлиента)
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	итWMSЗадачиТСД.ИдЗадачи,
	|	итWMSЗадачиТСД.Состояние,
	|	итWMSЗадачиТСД.ТСД,
	|	итWMSЗадачиТСД.ИдентификаторУпаковки
	|ПОМЕСТИТЬ ДействующиеЗадачиДокумента
	|ИЗ
	|	РегистрСведений.итWMSЗадачиТСД КАК итWMSЗадачиТСД
	|ГДЕ
	|	итWMSЗадачиТСД.ДокументОснование = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	итWMSЗадачиТСД.ИдЗадачи,
	|	итWMSЗадачиТСД.Состояние,
	|	итWMSЗадачиТСД.ТСД,
	|	итWMSЗадачиТСД.ИдентификаторУпаковки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	итWMSСтрокиЗадачТСД.идСтроки,
	|	ДействующиеЗадачиДокумента.ИдЗадачи,
	|	ДействующиеЗадачиДокумента.Состояние,
	|	ДействующиеЗадачиДокумента.ТСД,
	|	ДействующиеЗадачиДокумента.ИдентификаторУпаковки
	|ПОМЕСТИТЬ ДействующиеСтрокиЗадачДокумента
	|ИЗ
	|	ДействующиеЗадачиДокумента КАК ДействующиеЗадачиДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.итWMSСтрокиЗадачТСД КАК итWMSСтрокиЗадачТСД
	|		ПО ДействующиеЗадачиДокумента.ИдЗадачи = итWMSСтрокиЗадачТСД.ИдЗадачи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДействующиеСтрокиЗадачДокумента.ИдЗадачи
	|ПОМЕСТИТЬ НеобходимаяЗадача
	|ИЗ
	|	ДействующиеСтрокиЗадачДокумента КАК ДействующиеСтрокиЗадачДокумента
	|ГДЕ
	|	ДействующиеСтрокиЗадачДокумента.идСтроки = &идСтроки
	|
	|СГРУППИРОВАТЬ ПО
	|	ДействующиеСтрокиЗадачДокумента.ИдЗадачи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДействующиеСтрокиЗадачДокумента.идСтроки,
	|	ДействующиеСтрокиЗадачДокумента.ИдЗадачи КАК ИдЗадачи,
	|	ДействующиеСтрокиЗадачДокумента.Состояние КАК Состояние,
	|	ДействующиеСтрокиЗадачДокумента.ТСД,
	|	ДействующиеСтрокиЗадачДокумента.ИдентификаторУпаковки КАК ИдентификаторУпаковкиКоличество,
	|	ДействующиеСтрокиЗадачДокумента.ИдентификаторУпаковки КАК ИдентификаторУпаковки,
	|	итWMSРазмещениеТовары.Склад КАК Склад,
	|	итWMSРазмещениеТовары.Комментарий КАК Комментарий,
	|	итWMSРазмещениеТовары.ЯчейкаОтправитель КАК ЯчейкаОтправитель,
	|	итWMSРазмещениеТовары.ЯчейкаПолучатель КАК ЯчейкаПолучатель
	|ИЗ
	|	НеобходимаяЗадача КАК НеобходимаяЗадача
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДействующиеСтрокиЗадачДокумента КАК ДействующиеСтрокиЗадачДокумента
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.итWMSРазмещение.Товары КАК итWMSРазмещениеТовары
	|			ПО ДействующиеСтрокиЗадачДокумента.идСтроки = итWMSРазмещениеТовары.ИдентификаторСтроки
	|		ПО НеобходимаяЗадача.ИдЗадачи = ДействующиеСтрокиЗадачДокумента.ИдЗадачи
	|ГДЕ
	|	итWMSРазмещениеТовары.Ссылка = &Ссылка
	|ИТОГИ
	|	МАКСИМУМ(Состояние),
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ИдентификаторУпаковкиКоличество),
	|	МАКСИМУМ(ИдентификаторУпаковки),
	|	МАКСИМУМ(Склад),
	|	МАКСИМУМ(Комментарий),
	|	МАКСИМУМ(ЯчейкаОтправитель),
	|	МАКСИМУМ(ЯчейкаПолучатель)
	|ПО
	|	ИдЗадачи";
	
	Запрос.УстановитьПараметр("идСтроки", ИндификаторСтрокиКлиента);
	Запрос.УстановитьПараметр("Ссылка", объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() тогда
		Сообщить("Системная ошибка данных");
		Отказ=Истина;
		
		Возврат
	КонецЕсли;	
	ВыборкаИдЗадачи = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаИдЗадачи.Следующий() Цикл
		Если ВыборкаИдЗадачи.ИдентификаторУпаковкиКоличество<> 1 тогда
			Сообщить("Системная ошибка данных");
			Отказ=Истина;
			Возврат
			
		КонецЕсли;
		Если ВыборкаИдЗадачи.Состояние<> Перечисления.итWMSСостоянияЗадачТСД.КВыполнению Тогда 
			Сообщить("Задача занята ТСД , изменение не возможно");
			Отказ=Истина;
			Возврат
		КонецЕсли;
		СтруктураДанныхКИзменению.Вставить("ИдЗадачи",ВыборкаИдЗадачи.ИдЗадачи);
		СтруктураДанныхКИзменению.Вставить("ИдентификаторУпаковки",ВыборкаИдЗадачи.ИдентификаторУпаковки) ;
		СтруктураДанныхКИзменению.Вставить("Комментарий",ВыборкаИдЗадачи.Комментарий);
		СтруктураДанныхКИзменению.Вставить("Склад",ВыборкаИдЗадачи.Склад);
		СтруктураДанныхКИзменению.Вставить("ЯчейкаОтправитель",ВыборкаИдЗадачи.ЯчейкаОтправитель);
		СтруктураДанныхКИзменению.Вставить("ЯчейкаПолучатель",ВыборкаИдЗадачи.ЯчейкаПолучатель);
		ВыборкаДетальныеЗаписи = ВыборкаИдЗадачи.Выбрать();
		СписокСтрок=новый СписокЗначений;
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			СписокСтрок.Добавить(ВыборкаДетальныеЗаписи.идСтроки);
		КонецЦикла;
		СтруктураДанныхКИзменению.Вставить("СписокСтрок",СписокСтрок);
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьЯчейкуИлиСклад(Команда)
	Если ТекущийЭлемент.Имя="ТоварыДерево" тогда
		Если Элементы.ТоварыДерево.ТекущиеДанные.СтрокаУпаковки тогда
			ЭлементыДерева=Элементы.ТоварыДерево.ТекущиеДанные.ПолучитьЭлементы();
			Если ЭлементыДерева.Количество()=0 тогда
				Возврат
			иначе
				ИндификаторСтрокиКлиента=новый УникальныйИдентификатор(ЭлементыДерева[0].ИдентификаторСтрокиПредставление);
				
			КонецЕсли;
		иначе
			ИндификаторСтрокиКлиента=новый УникальныйИдентификатор(ЭлементыДерева[0].ИдентификаторСтрокиПредставление);
		КонецЕсли;
		//ИндификаторСтрокиКлиента=Элементы.ТоварыДерево.ТекущиеДанные.ПолучитьИдентификатор();
	ИначеЕсли ТекущийЭлемент.Имя="Товары" тогда
		ИндификаторСтрокиКлиента=Элементы.Товары.ТекущиеДанные.ИдентификаторСтроки;
	иначе
		Возврат;
	КонецЕсли;
	СтруктураДанныхКИзменению=новый Структура;
	Отказ=ложь;
	ИзменитьЯчейкуИлиСкладНаСервере(СтруктураДанныхКИзменению,Отказ,ИндификаторСтрокиКлиента);
	Если Отказ тогда
		Возврат
	КонецЕсли;
	ОткрытьФорму("Документ.итWMSРазмещение.Форма.ФормаИзмененияДанныхСтроки",СтруктураДанныхКИзменению,ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыСтратегии(Команда)
	Если Объект.СтратегияРазмещения.Пустая() Тогда 
		Сообщить("Укажите стратегию размещения");
		Возврат
	КонецЕсли;	
	Данные=ПолучитьИзВременногоХранилища(Объект.АдресХраненияПараметров);
	ОткрытьФорму("ОбщаяФорма.итWMSФормаПараметровСтратегии",новый Структура("Стратегия,ДанныеПараметров",Объект.СтратегияРазмещения,Данные),ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанныеТСД(Команда)
	ОбновитьДанныеСТСД();
КонецПроцедуры
&НаКлиенте
Процедура ПросмотрЗначения(Команда)
		Если ТекущийЭлемент.Имя="Товары"  Тогда
		Если ТипЗнч(ТекущийЭлемент.ТекущийЭлемент)=Тип("ПолеФормы") Тогда
			ИмяПоля=ТекущийЭлемент.ТекущийЭлемент.Имя;
			ДлинаСтроки=СтрДлина(ИмяПоля);			
			Если ТекущийЭлемент.Имя="Товары" Тогда
				ДлинаТЧ=СтрДлина("Товары");
			КонецЕсли;
			ПутьКДанным=Прав(ИмяПоля,ДлинаСтроки-ДлинаТЧ);
			//	#Если не ВебКлиент Тогда
			//	ОткрытьЗначение(ТекущийЭлемент.ТекущиеДанные[ПутьКДанным]);
			//#КонецЕсли	
			ПоказатьЗначение(,ТекущийЭлемент.ТекущиеДанные[ПутьКДанным]);
		КонецЕсли;
	КонецЕсли; 

КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервереБезКонтекста
Функция ПолучитьКартинкуИзБиблиотеки()
Возврат	БиблиотекаКартинок.ВнешнийИсточникДанныхКуб.ПолучитьДвоичныеДанные();
	КонецФункции

&НаСервере
Процедура ОбновитьДанныеСТСД()
Документы.итWMSРазмещение.ВнестиИзменениеДанныхТСДВДокумент(Объект.Ссылка);
Данные=Объект.Ссылка.ПолучитьОбъект();
Если итWMSСлужебныеПроцедурыИФункции.ВсеЗадачиДокументаЗафиксированны(Объект.Ссылка) Тогда
	Данные.ДействияПриФиксацииЗадачДокумента();
	Данные.ОбменДанными.Загрузка=Истина;
	//Данные.ОтложенноеПроведение=Истина; 
	Данные.Записать();  
	итWMSСлужебныеПроцедурыИФункции.СделатьЗаписьДопОбработкиОтложенногоПроведения(Данные.Ссылка);
КонецЕсли;
ЗначениеВРеквизитФормы(Данные,"Объект");
КонецПроцедуры
&НаСервере
Процедура ПроставитьПредставлениеИдентификатора()
	для Каждого  стр из Объект.Товары цикл
		стр.ИдентификаторСтрокиПредставление=Строка(стр.ИдентификаторСтроки);
	КонецЦикла;
КонецПроцедуры
&НаКлиенте
Процедура ВариантОтображенияПользователя()
	Если ТригерОтображения тогда
		ВВидеДерева("");
	иначе
		ВВидеСписка("");
	КонецЕсли;
КонецПроцедуры
&НаСервере
Функция ПолучитьТекущегоПользователя()
	Возврат	ПараметрыСеанса.ТекущийПользователь;
КонецФункции
&НаКлиенте
Процедура ОбработчикДиалогов(Результат,Параметры)Экспорт 
	Если Результат=КодВозвратаДиалога.Да тогда
		Выполнить(Параметры);
	иначе
		Возврат
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВидимостьДоступностьЭлементов()
	//Элементы.Филиал.Видимость=Объект.ПриемкаИзТранзита;
	//Элементы.НомерВходящегоДокумента.Видимость=Объект.ПриемкаИзТранзита;
	//Элементы.ДатаВходящегоДокумента.Видимость=Объект.ПриемкаИзТранзита;
	//Элементы.ГруппаДанныеФизическогоНосителя.Видимость=не Объект.ПриемкаИзТранзита;
	ВидимостьДоступностьЭлементовНаСервере();
	ВидимостьДоступностьЭлементовГифт();
КонецПроцедуры
&НаСервере
Процедура ВидимостьДоступностьЭлементовНаСервере()
	Если  Объект.СтатусДокумента=Перечисления.итWMSСтатусыСкладскихДокументов.Распределен или Объект.СтатусДокумента=Перечисления.итWMSСтатусыСкладскихДокументов.Распределяется тогда
		Элементы.ГруппаТовары.ТолькоПросмотр=Истина;
		//Элементы.ГруппаДанныеФизическогоНосителя.ТолькоПросмотр=Истина;
	иначе
		Элементы.ГруппаТовары.ТолькоПросмотр=Ложь;
		//Элементы.ГруппаДанныеФизическогоНосителя.ТолькоПросмотр=Ложь;
	КонецЕсли;
	Элементы.ТоварыРазместитьПаллеты.Видимость=(Объект.СтатусДокумента=Перечисления.итWMSСтатусыСкладскихДокументов.Создан);
	Элементы.ТоварыДеревоРазместитьПаллеты.Видимость=(Объект.СтатусДокумента=Перечисления.итWMSСтатусыСкладскихДокументов.Создан);
	Если Объект.СтатусДокумента=Перечисления.итWMSСтатусыСкладскихДокументов.Создан или Объект.СтатусДокумента=Перечисления.итWMSСтатусыСкладскихДокументов.Зарезервирован тогда
		Элементы.НеРаспределятьНаТСД.Видимость=Истина;
	иначе
		Элементы.НеРаспределятьНаТСД.Видимость=Ложь;
	КонецЕсли;
	Если Объект.СтатусДокумента=Перечисления.итWMSСтатусыСкладскихДокументов.Распределен тогда
		Элементы.ТоварыДеревоКонтекстноеМенюИзменитьЯчейкуИлиСклад.Видимость=Истина;
		Элементы.ТоварыКонтекстноеМенюИзменитьЯчейкуИлиСклад.Видимость=Истина;
	иначе
		Элементы.ТоварыДеревоКонтекстноеМенюИзменитьЯчейкуИлиСклад.Видимость=Ложь;
		Элементы.ТоварыКонтекстноеМенюИзменитьЯчейкуИлиСклад.Видимость=Ложь;
	КонецЕсли;
	
	//Элементы.ФормаЗавершитьПриемку.Видимость=ПриемкаВыполненна();
	//Элементы.ФормаОбновитьДанныеОтображения.Видимость=(ПриемкаВыполненна() или Объект.СтатусДокумента=Перечисления.итWMSСтатусыСкладскихДокументов.Завершен);
	//
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикТрансляцииПриИзменении(Элемент)
	СтрокаДерева=Элемент.Родитель.ТекущиеДанные;
	ПолеИзменения=СтрЗаменить(Элемент.Имя,"ТоварыДерево","");
	Если ЗначениеЗаполнено(СтрокаДерева.ИдентификаторСтрокиПредставление) тогда
		Строка=Объект.Товары.НайтиСтроки(новый Структура("ИдентификаторСтрокиПредставление",СтрокаДерева.ИдентификаторСтрокиПредставление));
		Строка[0][ПолеИзменения]=Элемент.Родитель.ТекущиеДанные[ПолеИзменения];
		ЭтаФорма.Модифицированность=Истина;
	КонецЕсли;
КонецПроцедуры
&НаКлиенте
Процедура РассчетКоличестваВУпаковкеПриИзменении(Элемент)
	СтрокаИзменения=Элемент.Родитель.ТекущиеДанные;
	ПолеИзменения=СтрЗаменить(Элемент.Имя,"ТоварыДерево","");
	Если не СтрокаИзменения.СтрокаУпаковки тогда
		РодительСтрокиИзменения=СтрокаИзменения.ПолучитьРодителя();
	иначе
		РодительСтрокиИзменения=СтрокаИзменения;
	КонецЕсли;
	РодительСтрокиИзменения[ПолеИзменения]=0;
	СтрокиДляПересчета=РодительСтрокиИзменения.ПолучитьЭлементы();
	для Каждого стр из СтрокиДляПересчета цикл
		РодительСтрокиИзменения[ПолеИзменения]=РодительСтрокиИзменения[ПолеИзменения]+ стр[ПолеИзменения];
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ГрупповоеИзменениеСпискаПоИдУпаковки(ПолеИзменения,Значение,ИдентификаторУпаковки)
	МассивСтрок=Объект.Товары.НайтиСтроки(Новый Структура("ИдентификаторУпаковки",ИдентификаторУпаковки));
	для Каждого стр из МассивСтрок цикл
		стр[ПолеИзменения]=Значение;
	КонецЦикла;	
КонецПроцедуры
&НаСервере
Функция ПроверкаНаИмещийсяДокументРазмещенияПоОснованию(Ссылка)
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	итWMSРазмещение.Ссылка
	|ИЗ
	|	Документ.итWMSРазмещение КАК итWMSРазмещение
	|ГДЕ
	|	итWMSРазмещение.итОснование = &Ссылка
	|	И итWMSРазмещение.Проведен = ИСТИНА";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если  ВыборкаДетальныеЗаписи.Следующий() тогда
		Возврат Истина;
	КонецЕсли;
	Возврат Ложь;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	
КонецФункции
&НаСервере
Функция ПроверкаНаЗавершенностьПриемкиОснования(Ссылка)
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	итWMSПриемка.Ссылка
	|ИЗ
	|	Документ.итWMSПриемка КАК итWMSПриемка
	|ГДЕ
	|	итWMSПриемка.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если  ВыборкаДетальныеЗаписи.Следующий() Тогда 
		Если ВыборкаДетальныеЗаписи.Ссылка.СтатусДокумента=Перечисления.итWMSСтатусыСкладскихДокументов.Завершен тогда
			Возврат Истина;
		иначе
			Возврат Ложь;
		КонецЕсли;	
	КонецЕсли;
	Возврат Ложь;
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	
КонецФункции
&НаСервере
Процедура ЗавершитьПримкуНаСервере(Ссылка)
	ДокументПриемки=Ссылка.ПолучитьОбъект();
	ДокументПриемки.СтатусДокумента=Перечисления.итWMSСтатусыСкладскихДокументов.Завершен;
	ДокументПриемки.Записать();
КонецПроцедуры
&НаСервере
Процедура ПроверкаНаЗаполненностьЯчейкиПолучателя(Отказ, ПараметрыЗаписи)
	Если Объект.СтатусДокумента	<> Перечисления.итWMSСтатусыСкладскихДокументов.Создан  или (Объект.СтатусДокумента = Перечисления.итWMSСтатусыСкладскихДокументов.Создан и ПараметрыЗаписи.РежимЗаписи=РежимЗаписиДокумента.Проведение )тогда
		для Каждого стр из Объект.Товары цикл
			Если стр.ЯчейкаПолучатель=Справочники.итСкладскиеЯчейки.ПустаяСсылка() тогда
				Сообщить(" для паллеты "+стр.ИдентификаторУпаковки+" не назначенна ячейка");
				Отказ=Истина;
			КонецЕсли;
		КонецЦикла;	
	КонецЕсли;
КонецПроцедуры
&НаСервере
Функция ПолучитьИерархиюСтратегииРазмещения()
	Возврат Справочники.итWMSСтратегии.Размещение;
КонецФункции

&НаКлиенте
Процедура ВосстановитьДанныеПараметровСтратегии() Экспорт 
	ВосстановитьДанныеПараметровСтратегииСервер();
КонецПроцедуры
&НаСервере
Процедура ВосстановитьДанныеПараметровСтратегииСервер()
	Данные=РеквизитФормыВЗначение("Объект");
	Объект.АдресХраненияПараметров=ПоместитьВоВременноеХранилище(Данные.ПараметрыСтратегии.Получить(),ЭтаФорма.УникальныйИдентификатор);
КонецПроцедуры

#КонецОбласти

#Область ГИФТ
&НаКлиенте
Процедура ГИФТ_СоздатьПТУ(Команда)
	Если ПроверкаНаСвязанноеПоступление() тогда
		Сообщить("у данного размещения есть поступление, если хотите создать новое, то предыдущее необходимо пометить на удаление");
		Возврат;
	КонецЕсли;	
	Форма=ПолучитьФорму("Обработка.итОбработкаТансляторУпрОбычноеПриложение.Форма.Форма");
	Форма.ДокументОснование=Объект.Ссылка;
	Форма.ДокументТрансляции="ПТУ";
	Форма.открыть();
	
КонецПроцедуры
&НаСервере
Функция ПроверкаНаСвязанноеПоступление()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПоступлениеТоваровУслуг.Ссылка
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
	|ГДЕ
	|	ПоступлениеТоваровУслуг.итОснование = &итОснование
	|	И ПоступлениеТоваровУслуг.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("итОснование", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если  ВыборкаДетальныеЗаписи.Следующий() тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
КонецФункции
&НаКлиенте
Процедура ВидимостьДоступностьЭлементовГифт()
	ВидимостьДоступностьЭлементовГифтНаСервере();
КонецПроцедуры
&НаСервере
Процедура ВидимостьДоступностьЭлементовГифтНаСервере()
	Если Объект.СтатусДокумента=Перечисления.итWMSСтатусыСкладскихДокументов.Завершен тогда
		Элементы.ФормаГИФТ_СоздатьПТУ.Видимость=Ложь;
		Элементы.ФормаОбновитьДанныеТСД.Видимость=Истина;
	иначе
		Элементы.ФормаГИФТ_СоздатьПТУ.Видимость=Ложь;
		Элементы.ФормаОбновитьДанныеТСД.Видимость=Ложь;
	КонецЕсли;
КонецПроцедуры
&НаСервере
Процедура ОбработкаИзмененияРаспределенныхДанных(СтруктураДанных)
	НачатьТранзакцию();
	Попытка
		для Каждого Строка из СтруктураДанных.СписокСтрок цикл
			МассивСтрок=Объект.Товары.НайтиСтроки(новый Структура("ИдентификаторСтроки",Строка.Значение));
			для Каждого стр из МассивСтрок цикл
				стр.ЯчейкаПолучатель=СтруктураДанных.ЯчейкаПолучатель;
				стр.Склад=СтруктураДанных.Склад;
			КонецЦикла;
		КонецЦикла;
		ЭтаФорма.Записать();
		НаборЗаписей=РегистрыСведений.итWMSЗадачиТСД.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ИдЗадачи.Установить(СтруктураДанных.ИдЗадачи);
		НаборЗаписей.Отбор.ДокументОснование.Установить(Объект.Ссылка);
		НаборЗаписей.Прочитать();
		Для Каждого Запись из НаборЗаписей цикл
			Запись.ЯчейкаПолучатель=СтруктураДанных.ЯчейкаПолучатель;
			Если Запись.ТСД<>Справочники.итWMSСправочникТСД.ПустаяСсылка() тогда
				НовыйНаборЗаписей=РегистрыСведений.итWMSЗадачиТСД.СоздатьНаборЗаписей();
				НовыйНаборЗаписей.Отбор.ИдЗадачи.Установить(Запись.ИдЗадачи);
				НовыйНаборЗаписей.Отбор.ДокументОснование.Установить(Запись.ДокументОснование);
				НовыйНаборЗаписей.Отбор.ТСД.Установить(Запись.ТСД);
				НовыйНаборЗаписей.Отбор.ТипЗадачи.Установить(Запись.ТипЗадачи);
				НовыйНаборЗаписей.Отбор.ИдЗадачиРодителя.Установить(Запись.ИдЗадачиРодителя);
				ПланыОбмена.ЗарегистрироватьИзменения(Запись.ТСД.УзелПланаОбмена,НовыйНаборЗаписей);	
			КонецЕсли;
		КонецЦикла;
		НаборЗаписей.Записать();
	Исключение
		ОтменитьТранзакцию();
	КонецПопытки;
	ЗафиксироватьТранзакцию();
КонецПроцедуры







#КонецОбласти
